title: Correlation - Potential Swarmer Persistence Activity
id: b3b8c221-872e-4cb2-8e10-388e40422998
status: experimental
description: Detects an offline registry library load followed by the creation of an NTUSER.MAN file 
    within 60 seconds by the same processGUID.
references:
    - https://www.praetorian.com/blog/corrupting-the-hive-mind-persistence-through-forgotten-windows-internals/
author: Kyrillos Reyad (kirollos.reyad@cylert-me.com)
date: 2026-02-25
correlation:
    type: ordered_temporal
    rules:
        - Suspicious Offline Registry Library Load  # 955b8807-5b2b-4b18-a064-4b5f4a7cfadd
        - NTUSER.MAN File Creation # 69dd5a59-d101-45e5-8490-fcd0ed43882c
    group-by:
        - ProcessGUID
    timespan: 60s
falsepositives:
    - unknown
level: high
---
title: Swarmer Base - Offreg.dll Load
name: Suspicious Offline Registry Library Load
id: 955b8807-5b2b-4b18-a064-4b5f4a7cfadd
description: Detects the loading of 'offreg.dll' (Offline Registry Library), excluding known legitimate Microsoft processes. This is often used by malware or 
    adversaries to manipulate registry hives without using the standard Windows Registry API.
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 7
        ImageLoaded|endswith: "offreg.dll"
    filter_legit_processes:
        Image|endswith:
            - "OfficeClickToRun.exe"
            - "MsMpEng.exe"
    condition: selection and not filter_legit_processes
---
title: Swarmer Base - NTUSER.MAN Creation
name: NTUSER.MAN File Creation
id: 69dd5a59-d101-45e5-8490-fcd0ed43882c
description: Detects the creation of a file containing NTUSER.MAN. This file is often created when an offline registry hive is manipulated, which can be a sign of persistence activity by malware or adversaries.
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 11
        TargetFilename|endswith: "NTUSER.MAN"
    condition: selection
level: low